#####################################################################

#ikilik sistem dönüştürme
ifade2 = "|{:b}|".format(1024)

print(ifade1)

#####################################################################

#sekizlik sistem dönüitürme
string = "{:o}".format(16)

print(string)

#####################################################################

#onaltılık sistem dönüştürme
string = "{:x}".format(42)

print(string)


#####################################################################
